# -*- coding: utf-8 -*-


import xlwt
import random
from datetime import datetime

style0 = xlwt.easyxf('font: name Times New Roman, color-index red, bold on', num_format_str='#,##0.00')
style1 = xlwt.easyxf(num_format_str='D-MMM-YY')

wb = xlwt.Workbook()
ws = wb.add_sheet('A Test Sheet')

ws.write(0, 0, "姓名", style0)
ws.write(0, 1, "国家", style0)
ws.write(0, 2, "手机号", style0)
ws.write(0, 3, "单位", style0)
for i in range(1, 40000, 1):

    xing = '赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍郤璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越隆师巩聂晁勾敖融冷辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查後荆红游竺权逯盖益桓'
    ming = '伟裳芳樵牧傅贞娜兴材岚诚闪溢修露慕敏琼贤谨始钰斌曼自菡原焕少枫佩新俊婉巡骋嫣碧珠馨眉静秀子皓曦轩梓闰萱诗涵兆瑛纾菲汝芊卿蓝占巧海真夏婧玖希妮胤绍洋尧杏泉歌仁沐奕良懿州昊建渭国谦逸科传晶湘栋华和奇平浩然明军坚学恒微徳煜峰锐飞净楚瑞芹健致娅楠蓉泰卓灵秋翠茜慧旭锦勇祥松伦强嵩珊剑斌刚素涛波辉磊维嘉超鹏杰鑫澜亨帅炎衡鹤宇豪桂英玉梅媛兰珍琳忠凤德柯萍蓓霏扬迎继民坤博圣耀璞红钧吟鸽沙鼎冲巍岩莲尚保树江宝柱丽瑶霞茹献燕娟冉倩艳瑜晨同烟墨薇丝旻蕾佑桓康丹培天烨玲牛婷雪倩豫壮济善欣怡娴闻朋慈啸邦楷悦道白洪蝶岳浦佳颖雨紫宣芝一忆炳诺腾润钟瑾承淮婕恩翰彰程采彤祺睿惠语洁沛家翔淑宥廷晴辰品柏妍咏羽禹妤芯绮思梦雄正姣武隆文耿融潮韶霄棕拓图勉炫熙标冠驰寒桦观乾昌琴仕倚琪蓁昆晖美裕誉勋雅君旷娥月宜渊芬彦宏箫金念木铠水广哲桐火征土利益庆士喜银全旺冬会世立茂芙凌菱展漪春蝉靖婵风雷韵智芷荷仲凯云帆霜龙连凡昕毅威雯霖胜凯泽筱舒芸依财生荣虹爱光远青宗振震畅古珺亮清东航尊宁福敬源唯田励冰漾悟璋深勤阳灿欧增萧雁玄彬才玟晓聪安乐师长铎鸿富重莉临温漫'
    x = random.choice(xing)
    m = "".join(random.choice(ming) for i in range(1, 3))
    name = x + m

    prelist = ["130", "131", "132", "133", "134", "135", "136", "137", "138", "139", "147", "150", "151", "152",
           "153", "155", "156", "157", "158", "159", "186", "187", "188"]
    randomPre = random.choice(prelist)
    Number = "".join(random.choice("0123456789") for i in range(8))
    phoneNum = randomPre +Number

    ws.write(i, 0, name)
    ws.write(i, 1, "中国大陆")
    ws.write(i, 2, phoneNum)
    ws.write(i, 3, "测试单位")
else:
    print("循环结束")

wb.save('example.xls')




